# Pandas基础使用

In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

## 重新索引

In [3]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

## 插值

method选项:ffill或pad 向前填充（或搬运）值；
bfill或backfill 向后填充（或搬运）值

In [7]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [8]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
obj3.reindex(range(6),method='pad')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [12]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                  columns=['ohio','texas','california'])
frame

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>ohio</th>
      <th>texas</th>
      <th>california</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>c</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>d</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

In [13]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>ohio</th>
      <th>texas</th>
      <th>california</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>b</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>c</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>d</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

In [15]:
frame2 = frame.reindex(columns=['texas','utah','california'])
frame2

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>texas</th>
      <th>utah</th>
      <th>california</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>1</td>
      <td>NaN</td>
      <td>2</td>
    </tr>
    <tr>
      <th>c</th>
      <td>4</td>
      <td>NaN</td>
      <td>5</td>
    </tr>
    <tr>
      <th>d</th>
      <td>7</td>
      <td>NaN</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

In [16]:
frame2 = frame.reindex(index=['a','b','c','d'],method='ffill',columns=['texas','utah','california'])
frame2

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>texas</th>
      <th>utah</th>
      <th>california</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>a</th>
      <td>1</td>
      <td>NaN</td>
      <td>2</td>
    </tr>
    <tr>
      <th>b</th>
      <td>1</td>
      <td>NaN</td>
      <td>2</td>
    </tr>
    <tr>
      <th>c</th>
      <td>4</td>
      <td>NaN</td>
      <td>5</td>
    </tr>
    <tr>
      <th>d</th>
      <td>7</td>
      <td>NaN</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

## 丢弃行（index指定的项）

In [17]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: float64

In [19]:
new_obj = obj.drop(['c','d']) #丢弃index是c、d的行
new_obj

a    0
b    1
e    4
dtype: float64

In [20]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['ohio','colorado','utah','new york'],
                 columns=['one','two','three','four'])
data

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>one</th>
      <th>two</th>
      <th>three</th>
      <th>four</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ohio</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>colorado</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>utah</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>new york</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [22]:
new_data = data.drop(['colorado','ohio'])
new_data

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>one</th>
      <th>two</th>
      <th>three</th>
      <th>four</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>utah</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>new york</th>
      <td>12</td>
      <td>13</td>
      <td>14</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

## 算术运算和数据对齐

In [2]:
s1 = Series([7.3, -2.5, 3.4, 1.5],index=['a','c','d','e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [3]:
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [4]:
s1+s2  #两项都必须有数，否则结果为nan

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [5]:
d1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),
               index=['ohio','texas','colorado'])

In [6]:
d2 = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),
               index=['utah','ohio','texas','oregon'])

In [7]:
d1,d2

(          b  c  d
 ohio      0  1  2
 texas     3  4  5
 colorado  6  7  8,         b   d   e
 utah    0   1   2
 ohio    3   4   5
 texas   6   7   8
 oregon  9  10  11)

In [8]:
d1+d2

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>colorado</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>ohio</th>
      <td>3</td>
      <td>NaN</td>
      <td>6</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>oregon</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>9</td>
      <td>NaN</td>
      <td>12</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>utah</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

## 填充

In [9]:
d1.add(d2,fill_value=0)

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>colorado</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>ohio</th>
      <td>3</td>
      <td>1</td>
      <td>6</td>
      <td>5</td>
    </tr>
    <tr>
      <th>oregon</th>
      <td>9</td>
      <td>NaN</td>
      <td>10</td>
      <td>11</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>9</td>
      <td>4</td>
      <td>12</td>
      <td>8</td>
    </tr>
    <tr>
      <th>utah</th>
      <td>0</td>
      <td>NaN</td>
      <td>1</td>
      <td>2</td>
    </tr>
  </tbody>
</table>
</div>

## DataFrame和Series操作

In [15]:
s0 = d1.ix[0]
s0

b    0
c    1
d    2
Name: ohio, dtype: float64

In [13]:
d1

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ohio</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>colorado</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

In [16]:
d1-s0

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ohio</th>
      <td>0</td>
      <td>0</td>
      <td>0</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>3</td>
      <td>3</td>
      <td>3</td>
    </tr>
    <tr>
      <th>colorado</th>
      <td>6</td>
      <td>6</td>
      <td>6</td>
    </tr>
  </tbody>
</table>
</div>

In [18]:
d1.sub(d1.b,axis=0)

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ohio</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>colorado</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
  </tbody>
</table>
</div>

## 函数应用和映射

In [19]:
np.abs(d1)

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ohio</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>3</td>
      <td>4</td>
      <td>5</td>
    </tr>
    <tr>
      <th>colorado</th>
      <td>6</td>
      <td>7</td>
      <td>8</td>
    </tr>
  </tbody>
</table>
</div>

将函数应用到各列或者行所形成的一维数组上

In [20]:
f = lambda x:x.max()-x.min()

In [21]:
d1.apply(f,axis=1)

ohio        2
texas       2
colorado    2
dtype: float64

## 汇总和统计计算

In [23]:
d1.sum()

b     9
c    12
d    15
dtype: float64

In [24]:
d1.mean()

b    3
c    4
d    5
dtype: float64

In [25]:
d1.sum(axis=1)

ohio         3
texas       12
colorado    21
dtype: float64

In [26]:
d1.idxmax()

b    colorado
c    colorado
d    colorado
dtype: object

In [27]:
d1.cumsum()

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>ohio</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>texas</th>
      <td>3</td>
      <td>5</td>
      <td>7</td>
    </tr>
    <tr>
      <th>colorado</th>
      <td>9</td>
      <td>12</td>
      <td>15</td>
    </tr>
  </tbody>
</table>
</div>

In [28]:
d1.describe()

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>c</th>
      <th>d</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>count</th>
      <td>3.0</td>
      <td>3.0</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>mean</th>
      <td>3.0</td>
      <td>4.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>std</th>
      <td>3.0</td>
      <td>3.0</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>min</th>
      <td>0.0</td>
      <td>1.0</td>
      <td>2.0</td>
    </tr>
    <tr>
      <th>25%</th>
      <td>1.5</td>
      <td>2.5</td>
      <td>3.5</td>
    </tr>
    <tr>
      <th>50%</th>
      <td>3.0</td>
      <td>4.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>75%</th>
      <td>4.5</td>
      <td>5.5</td>
      <td>6.5</td>
    </tr>
    <tr>
      <th>max</th>
      <td>6.0</td>
      <td>7.0</td>
      <td>8.0</td>
    </tr>
  </tbody>
</table>
</div>

In [29]:
d1.std()

b    3
c    3
d    3
dtype: float64

In [32]:
import pandas.io.data as web
all_data={}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')
price = DataFrame({tic:data['Adj Close'] for tic,data in all_data.iteritems()})
volume = DataFrame({tic:data['Volume'] for tic,data in all_data.iteritems()})

In [33]:
returns = price.pct_change()

In [34]:
returns.tail()

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>AAPL</th>
      <th>GOOG</th>
      <th>IBM</th>
      <th>MSFT</th>
    </tr>
    <tr>
      <th>Date</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>2009-12-24</th>
      <td>0.034339</td>
      <td>0.011117</td>
      <td>0.004385</td>
      <td>0.002587</td>
    </tr>
    <tr>
      <th>2009-12-28</th>
      <td>0.012294</td>
      <td>0.007098</td>
      <td>0.013326</td>
      <td>0.005484</td>
    </tr>
    <tr>
      <th>2009-12-29</th>
      <td>-0.011861</td>
      <td>-0.005571</td>
      <td>-0.003477</td>
      <td>0.007058</td>
    </tr>
    <tr>
      <th>2009-12-30</th>
      <td>0.012147</td>
      <td>0.005376</td>
      <td>0.005461</td>
      <td>-0.013699</td>
    </tr>
    <tr>
      <th>2009-12-31</th>
      <td>-0.004300</td>
      <td>-0.004416</td>
      <td>-0.012597</td>
      <td>-0.015504</td>
    </tr>
  </tbody>
</table>
</div>

In [36]:
returns.MSFT.corr(returns.IBM)

0.49597967972033769

In [37]:
returns.MSFT.cov(returns.IBM)

0.00021595764064430057

In [38]:
returns.corr()

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>AAPL</th>
      <th>GOOG</th>
      <th>IBM</th>
      <th>MSFT</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>AAPL</th>
      <td>1.000000</td>
      <td>0.470676</td>
      <td>0.410011</td>
      <td>0.424305</td>
    </tr>
    <tr>
      <th>GOOG</th>
      <td>0.470676</td>
      <td>1.000000</td>
      <td>0.390689</td>
      <td>0.443587</td>
    </tr>
    <tr>
      <th>IBM</th>
      <td>0.410011</td>
      <td>0.390689</td>
      <td>1.000000</td>
      <td>0.495980</td>
    </tr>
    <tr>
      <th>MSFT</th>
      <td>0.424305</td>
      <td>0.443587</td>
      <td>0.495980</td>
      <td>1.000000</td>
    </tr>
  </tbody>
</table>
</div>

In [39]:
returns.cov()

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>AAPL</th>
      <th>GOOG</th>
      <th>IBM</th>
      <th>MSFT</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>AAPL</th>
      <td>0.001027</td>
      <td>0.000303</td>
      <td>0.000252</td>
      <td>0.000309</td>
    </tr>
    <tr>
      <th>GOOG</th>
      <td>0.000303</td>
      <td>0.000580</td>
      <td>0.000142</td>
      <td>0.000205</td>
    </tr>
    <tr>
      <th>IBM</th>
      <td>0.000252</td>
      <td>0.000142</td>
      <td>0.000367</td>
      <td>0.000216</td>
    </tr>
    <tr>
      <th>MSFT</th>
      <td>0.000309</td>
      <td>0.000205</td>
      <td>0.000216</td>
      <td>0.000516</td>
    </tr>
  </tbody>
</table>
</div>

## 唯一值、值计数、成员资格

In [40]:
obj = Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [41]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [42]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [43]:
obj.isin(['b','c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

## 绘制直方图

In [45]:
data = DataFrame({'Qu1':[1,2,3,4,3],
                 'Qu2':[2,3,1,2,3],
                 'Qu3':[1,5,2,4,4]})
data

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Qu1</th>
      <th>Qu2</th>
      <th>Qu3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>2</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
      <td>5</td>
    </tr>
    <tr>
      <th>2</th>
      <td>3</td>
      <td>1</td>
      <td>2</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4</td>
      <td>2</td>
      <td>4</td>
    </tr>
    <tr>
      <th>4</th>
      <td>3</td>
      <td>3</td>
      <td>4</td>
    </tr>
  </tbody>
</table>
</div>

In [46]:
data.apply(pd.value_counts).fillna(0)

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Qu1</th>
      <th>Qu2</th>
      <th>Qu3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>1</td>
      <td>1</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>2</td>
      <td>1</td>
    </tr>
    <tr>
      <th>3</th>
      <td>2</td>
      <td>2</td>
      <td>0</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1</td>
      <td>0</td>
      <td>2</td>
    </tr>
    <tr>
      <th>5</th>
      <td>0</td>
      <td>0</td>
      <td>1</td>
    </tr>
  </tbody>
</table>
</div>

## 处理缺失数据

In [47]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [48]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [49]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [51]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])

In [52]:
data.dropna() #只要含有nan的行都drop掉

0    1.0
2    3.5
4    7.0
dtype: float64

In [53]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [54]:
data = DataFrame([[1.,6.5,3.],
                  [1.,NA,NA],
                  [NA,NA,NA],
                  [NA,6.5,3.1]])
data.dropna() #默认去掉了只要含有nan的所有行

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3</td>
    </tr>
  </tbody>
</table>
</div>

In [55]:
data.dropna(how='all') #去掉全是nan的行

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>NaN</td>
      <td>6.5</td>
      <td>3.1</td>
    </tr>
  </tbody>
</table>
</div>

In [56]:
data.dropna(how='all',axis=1) #去掉全是nan的列

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>NaN</td>
      <td>6.5</td>
      <td>3.1</td>
    </tr>
  </tbody>
</table>
</div>

In [57]:
data.dropna(thresh=2) #去掉一行有两个或者两个以上的nan的行

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>NaN</td>
      <td>6.5</td>
      <td>3.1</td>
    </tr>
  </tbody>
</table>
</div>

In [58]:
data.fillna(0)

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>0.0</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0</td>
      <td>0.0</td>
      <td>0.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0</td>
      <td>6.5</td>
      <td>3.1</td>
    </tr>
  </tbody>
</table>
</div>

In [59]:
data.fillna({1:0.5,3:-1}) #对不同列填充不同的值

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>0.5</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>NaN</td>
      <td>0.5</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>3</th>
      <td>NaN</td>
      <td>6.5</td>
      <td>3.1</td>
    </tr>
  </tbody>
</table>
</div>

In [60]:
data.fillna(data.mean()) #填充列平均值

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.00</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.05</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.05</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>6.5</td>
      <td>3.10</td>
    </tr>
  </tbody>
</table>
</div>

## 层次化索引

In [63]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],
                                         [1,2,3,1,2,3,1,2,2,3]])
datadasta

a  1    0.897190
   2   -0.077133
   3   -1.215964
b  1   -0.478894
   2   -0.277790
   3    1.204157
c  1   -0.625554
   2    1.263327
d  2    0.194274
   3    1.266429
dtype: float64

In [64]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

## 基于整数的索引

In [66]:
d1 = DataFrame(np.arange(12).reshape((3,4)))
d1

<div style="max-width:1500px;overflow:auto;">
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
      <td>2</td>
      <td>3</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4</td>
      <td>5</td>
      <td>6</td>
      <td>7</td>
    </tr>
    <tr>
      <th>2</th>
      <td>8</td>
      <td>9</td>
      <td>10</td>
      <td>11</td>
    </tr>
  </tbody>
</table>
</div>

In [67]:
d1.icol(1) #获得第1列

0    1
1    5
2    9
Name: 1, dtype: int32

In [68]:
d1.irow(1) #获得第一行

0    4
1    5
2    6
3    7
Name: 1, dtype: int32

In [70]:
d1.irow(1).iget(1)

5

In [72]:
d1.iget_value(1,1)

5